CF/DataProcessors/ЗаполнениеДиапазонаСерийныхНомеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеДиапазонаСерийныхНомеров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыборВДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьМагнитныеКоды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьШтрихкоды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйШтрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйШтрихкодEAN13</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйШтрихкодEAN8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихкодаРТ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСимволов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

CF/DataProcessors/ЗаполнениеДиапазонаСерийныхНомеров/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если НЕ ЕстьМагнитныеКоды ИЛИ ВыборВДокумент Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоСимволов");
		
	КонецЕсли;
	
	Если ЕстьШтрихкоды Тогда
		
		Если ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкод");
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN8");
		ИначеЕсли ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкод");
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN13");
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN8");
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN13");
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкод");
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN8");
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN13");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
